[
  {
    "domain": "security",
    "query": "Show me all failed logins from the last week including failure reason, ip_address and username.",
    "status": "success",
    "sql": "SELECT le.failure_reason, le.ip_address, u.username FROM login_events le JOIN users u ON le.user_id = u.user_id WHERE UPPER(le.status) LIKE '%FAILED%' AND le.created_at >= '2026-01-31 08:43:18'",
    "insight": null,
    "recommendation": null,
    "has_results": false
  },
  {
    "domain": "compliance",
    "query": "Show me all transactions greater than $10,000 made by users who are flagged as PEP (Politically Exposed Person).",
    "status": "success",
    "sql": "SELECT t.* FROM transactions t JOIN users u ON t.user_id = u.user_id WHERE t.amount_usd > 10000 AND UPPER(u.is_pep) LIKE '%TRUE%';",
    "insight": null,
    "recommendation": null,
    "has_results": false
  },
  {
    "domain": "risk",
    "query": "Calculate the total transaction amount in USD for users grouped by their risk_level.",
    "status": "success",
    "sql": "SELECT u.risk_level, SUM(t.amount_usd) FROM users u JOIN transactions t ON u.user_id = t.user_id GROUP BY u.risk_level",
    "insight": "Our analysis of transaction amounts grouped by risk level reveals a significant concentration of financial activity within the 'LOW' risk category, accounting for approximately 45% of the total USD transaction volume observed. Conversely, 'CRITICAL' risk transactions, while representing the smallest segment, warrant immediate attention due to their inherent potential for severe financial or reputational damage.  The substantial volume in 'HIGH' and 'MEDIUM' categories also presents a considerable aggregate exposure that requires continuous monitoring and proactive risk mitigation strategies.",
    "recommendation": "1. Initiate a targeted review of our 'CRITICAL' risk transaction protocols to identify any immediate vulnerabilities and implement enhanced validation measures to prevent potential financial losses or compliance breaches. 2. Develop and deploy enhanced anomaly detection algorithms specifically for transactions classified as 'HIGH' and 'MEDIUM' risk, focusing on identifying patterns that may indicate emerging fraudulent activity or policy violations, thereby proactively reducing our overall risk exposure.",
    "has_results": true
  },
  {
    "domain": "operations",
    "query": "What is the success rate of transactions broken down by payment method?",
    "status": "success",
    "sql": "SELECT payment_method, CAST(SUM(CASE WHEN UPPER(status) LIKE '%SUCCESS%' THEN 1 ELSE 0 END) AS REAL) * 100 / COUNT(*) FROM transactions GROUP BY payment_method",
    "insight": "The provided data indicates a critical operational issue: a 0% success rate across all payment methods for recent transactions. This signifies a complete failure in our transaction processing system, posing an immediate and severe risk to revenue, customer satisfaction, and operational continuity. The company is effectively unable to process any payments successfully, which will have catastrophic financial and reputational consequences if not addressed urgently.",
    "recommendation": "1. **Immediate System-Wide Outage Investigation:** Launch an urgent, cross-functional incident response team to identify the root cause of the 0% transaction success rate across all payment methods. Prioritize a full rollback or hotfix to restore transaction processing capabilities. 2. **Proactive Customer Communication Strategy:** Develop and prepare a transparent communication plan to inform affected customers about the ongoing issue and the steps being taken to resolve it, mitigating potential reputational damage and churn.",
    "has_results": true
  }
]